<?php
/*
Template Name: Услуга 3.5.1 Русский
*/
?>

<?php get_header() ?>

    <main class="page-main">
        <section class="upper-block">
            <div class="upper-block__wrapper wrapper">
                <div class="upper-block__breadcrumbs breadcrumbs wow fadeInUp">
                    <ul class="breadcrumbs__list">
                        <li class="breadcrumbs__item"><a href="<?php echo get_home_url(); ?>">Главная</a></li>
                        <li class="breadcrumbs__item"><a>Услуги</a></li>
                        <li class="breadcrumbs__item"><a>Облачные услуги</a></li>
                        <li class="breadcrumbs__item">Облачный консалтинг</li>
                    </ul>
                </div>

                <div class="upper-block__text upper-block__text--big wow fadeInUp">
                    <h1 class="upper-block__title title">Облачный <strong>консалтинг</strong></h1>
                    <p>Обеспечьте бесперебойную работу систем для достижения бизнес-целей.</p>
                </div>
            </div>

            <img class="upper-block__image" src="<?php echo get_template_directory_uri() ?>/assets/img/3-5-1_1.jpg"
                 alt="">
        </section>

        <section class="about">
            <div class="about__wrapper wrapper">
                <div class="about__content wow fadeInUp hidden">
                    <div class="about__text">
                        <h2 class="about__title title">Что мы <strong>предлагаем</strong></h2>

                        <p>Независимо от того на каком этапе перемещения Вашего проекта в облако Вы находитесь, мы проконсультируем Вас и поможем подобрать наиболее оптимальный вариант для успешного завершения процесса. Мы проанализируем потребности, необходимые затраты, спроектируем, оптимизируем или модернизируем облачное решение и осуществим миграцию бизнеса в облако.</p>

                        <a href="#page-form" class="button button--blue contact-button">Свяжитесь с нами</a>
                    </div>

                    <div class="about__image-block wow fadeInUp">
                        <img class="about__image" src="<?php echo get_template_directory_uri() ?>/assets/img/3-5-1-blok-1.jpg" alt="">
                    </div>
                </div>
            </div>
        </section>

        <section class="info">
            <div class="info__wrapper wrapper">

                <ol class="info__list steps">
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Анализ конфигурации облачного решения</h4>
                            <p>Специалист-консультант определит потребности, чтобы выбрать необходимые облачные параметры, максимально подходящие в Вашем случае. Посоветует оптимального облачного провайдера, оценит потенциальные проблемы и риски, а также конкретные преимущества, применимые в Вашей ситуации.</p>
                        </div>
                    </li>

                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Анализ рисков и безопасности</h4>
                            <p>Крупные провайдеры облачных решений следуют высочайшим стандартам безопасности системы. Тем не менее, слабым местом всегда остается человеческий фактор. Мы предусмотрели всё и знаем как использовать адекватные локальные политики и правила для того, чтобы создать облачный проект высочайшего класса безопасности.</p>
                        </div>
                    </li>

                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Проектирование и разработка облачных решений</h4>
                            <p>Мы разработаем дизайн и реализацию облачного решения с подходом, который наилучшим образом подходит для Вас. Подберем оптимальную облачную модель, начиная от простых готовых решений (SaaS и PaaS), до инфраструктурных решений (IaaS) с полным доступом к операционной системе на выделенных виртуальных серверах. Выбирайте то, что наилучшим образом подходит для Вашей бизнес-модели.</p>
                        </div>
                    </li>

                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Миграция в облако</h4>
                            <p>Это непростая задача, связанная зачастую с огромным количеством вводных данных и нюансов, которые необходимо учесть для успешного завершения процесса миграции. Дополнив свою команду нашими опытными специалистами, Вы сможете решить все эти проблемы. Вы получите от нас дорожную карту с точным планом действий, с помощью которой мы сможем осуществить переход от локальной среды к облаку.</p>
                        </div>
                    </li>

                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Консалтинг и услуги CloudOps</h4>
                            <p>Мы создадим архитектуру облачной инфраструктуры, что оптимизирует расходы, повысит производительность, кратно уменьшит риск инцидентов и вероятность безвозвратной потери данных. Даже в самом крайнем случае восстановить систему и потерянные данные можно будет в максимально сжатые сроки, так как данные надежно и многократно резервируются. Мы также поможем с оценкой рентабельности облачных инвестиций.</p>
                        </div>
                    </li>
                </ol>
            </div>
        </section>

        <section class="reception">
            <div class="reception__wrapper wrapper">
                <h2 class="reception__title title wow fadeInUp">Почему <strong>стоит работать</strong> с облачными решениями</h2>

                <div class="reception__text wow fadeInUp">
                    <p>Многочисленные исследования облачных решений в интернете показали, что для получения адекватных результатов требуются правильно и тонко настроенные сервисы, а также достаточный опыт, чтобы избежать потерь финансов, времени и данных. Для плавной и выгодной миграции в облако требуется опытный партнёр, готовый поддержать Вас. Это решение поможет Вам:</p>

                    <ul>
                        <li>Воспользоваться такими преимуществами облака, как повышенная безопасность, возможность масштабирования по мере роста бизнеса, гибкость в организации рабочих процессов, сокращение времени выхода продуктов на рынок, использование новейших технологий.</li>
                        <li>Принимать правильные решения на всём этапе миграции.</li>
                        <li>Дать сотрудникам наилучшее понимание того, как управлять облачными решениями внутри компании.</li>
                        <li>Узнать как максимально эффективно использовать облако во всех бизнес-процессах  здесь и сейчас, а также в будущем.</li>
                    </ul>
                </div>
            </div>
        </section>

        <section class="discuss">
            <?php include 'contact-form.php' ?>
        </section>
    </main>

<?php get_footer() ?>