<?php
/*
Template Name: Услуга 3.2 Русский
*/
?>

<?php get_header() ?>

    <main class="page-main">
        <section class="upper-block">
            <div class="upper-block__wrapper wrapper">
                <div class="upper-block__breadcrumbs breadcrumbs wow fadeInUp">
                    <ul class="breadcrumbs__list">
                        <li class="breadcrumbs__item"><a href="<?php echo get_home_url(); ?>">Главная</a></li>
                        <li class="breadcrumbs__item"><a>Услуги</a></li>
                        <li class="breadcrumbs__item">Веб разработка</li>
                    </ul>
                </div>

                <div class="upper-block__text upper-block__text--big wow fadeInUp">
                    <h1 class="upper-block__title title">Наши веб-решения <strong>создают превосходства</strong> для&nbsp;Вашего продукта</h1>
                    <p>Правильное представление продукта в Интернете – главное условие для получения высоких продаж.</p>
                </div>
            </div>

            <img class="upper-block__image" src="<?php echo get_template_directory_uri() ?>/assets/img/3.2_1.jpg"
                 alt="">
        </section>

        <section class="team">
            <div class="team__wrapper wrapper">
                <ul class="team__list team-slider">
                    <li class="team-slider__item">
                        <img class="team-slider__image wow animLeft" src="<?php echo get_template_directory_uri() ?>/assets/img/3-2-blok-1.jpg" alt="">
                        <div class="team-slider__text-block wow animRight">
                            <div class="team-slider__text">
                                <h2><strong>Веб-разработка</strong></h2>
                                <p>Мы располагаем большой командной высококлассных Front-end, Back-end разработчиков и
                                    великолепных дизайнеров для новых, захватывающих проектов.</p>
                                <p>Наши специалисты в области интернет-решений обладают многолетним опытом в разработке
                                    сотен проектов разнообразной сложности, от простых лендингов до крупнейших
                                    веб-порталов. Мы постоянно совершенствуемся в этой сфере, не отставая от новейших
                                    технологий, изучая и внедряя их на всех этапах разработки.</p>
                                <p>Мы поможем Вам проанализировать, спланировать и разработать веб-продукт любой
                                    сложности, от дизайна до крупных порталов и уникальных веб-приложений на заказ.</p>
                                <a href="#page-form" class="button button--blue contact-button">Свяжитесь с нами</a>
                            </div>
                        </div>
                    </li>
                </ul>
            </div>
        </section>

        <section class="banner banner--margin-top">
            <div class="banner__wrapper banner__wrapper--big wrapper">
                <h2 class="banner__title title wow fadeInLeftBig">Наши <strong>веб-решения</strong> создадут преимущество для Вашего бизнеса</h2>

                <div class="banner__text wow fadeInRightBig">
                    <p>Мы создадим любые типы программного обеспечения и обеспечим удобство работы веб-пользователей. Разнообразные типы веб-решений могут казаться похожими, но наш подход во всестороннем рассмотрении каждой возникшей задачи и проблемы. Мы знаем, какие условия играют главную роль в каждом случае. Применяя новейшие технологии, принципы разработки и веяния в отрасли дизайна, мы создадим уникальный, неповторимый продукт, который станет лицом Вашей компании в сети.</p>
                </div>
            </div>
        </section>

        <section class="path">
            <div class="path__main-wrapper wrapper">
                <h2 class="path__title title wow fadeInUp">Как мы автоматизируем Ваш <strong>бизнес</strong></h2>
                <div class="path__list-container">
                    <div class="path__list-wrapper path__list-wrapper--two swiper-container">
                        <ul class="path__list strategies swiper-wrapper">
                            <li class="strategies__item swiper-slide wow fadeInUp">
                                <div class="strategies__icon-block">
                                    <img class="strategies__icon" src="<?php echo get_template_directory_uri() ?>/assets/img/stages-icon-26.svg" alt="">
                                </div>

                                <p class="strategies__title">Веб-порталы</p>

                                <p class="strategies__text">
                                    Веб портал – это универсальный ресурс с большим набором функций и возможностей. Как правило, веб-портал охватывает полностью или большую часть сфер деятельности компании, предоставляя всю необходимую информацию для разных пользователей, персонала, партнёров и т.п. Во многих случаях выгоднее, как с точки зрения инвестиций и управления процессами, так и для привлечения максимально широкой аудитории потенциальных клиентов не распылять внимание на несколько отдельных сайтов с разнообразной тематикой для каждого направления деятельности, а создать цельную систему представительства компании онлайн и управления бизнес-процессами в одном массивном ресурсе.
                                    Мы создаем веб-порталы для разных целевых аудиторий: клиентов, деловых партнёров, для внутреннего использования сотрудниками организаций, пользователей электронной коммерции, пациентов, поставщиков, групп по интересам и другие. Благодаря опытной команде аналитиков, дизайнеров, разработчиков, маркетологов и других специалистов Вы будете уверены в достижении поставленных задач и заданных целей.
                                </p>
                            </li>

                            <li class="strategies__item swiper-slide wow fadeInUp">
                                <div class="strategies__icon-block">
                                    <img class="strategies__icon" src="<?php echo get_template_directory_uri() ?>/assets/img/stages-icon-27.svg" alt="">
                                </div>

                                <p class="strategies__title">Веб приложения</p>

                                <p class="strategies__text">
                                    Когда у Вас возникает необходимость автоматизировать какой-то процесс, создать удобную среду обработки или анализа данных, систему управление бизнес-процессами, возникает необходимость обратиться к разработчикам веб-приложений, способным удовлетворить Ваши потребности. Наша команда инженеров-разработчиков ПО всегда поможет Вам в этом. Находясь на острие технологий, они предложат наиболее оптимальное решение, основываясь на информации, собранной и проанализированной нашими аналитиками. В результате Вы получите адаптированное под Ваши требования, современное решение с необходимым персонально для Вас функционалом. Мы применяем интеллектуальную автоматизацию для оптимизации рабочих процессов и интеграции корпоративных приложений для согласованной работы.
                                </p>
                            </li>

                            <li class="strategies__item swiper-slide wow fadeInUp">
                                <div class="strategies__icon-block">
                                    <img class="strategies__icon" src="<?php echo get_template_directory_uri() ?>/assets/img/stages-icon-24.svg" alt="">
                                </div>

                                <p class="strategies__title">Веб дизайн</p>

                                <p class="strategies__text">
                                    Первое впечатление от любого продукта, будь то веб-портал или приложение, пользователь получает от визуальной составляющей. Блеклый сайт с непривлекательным дизайном, даже обладающий мощным функционалом, не привлечёт внимание Ваших потенциальных клиентов. И наоборот - яркий дизайн, правильно расположенные элементы, которые позволяют зацепиться взгляду за главное, оставляет отличные впечатления и провоцирует пользователя вернуться и пользоваться Вашим продуктом снова и снова.
                                    Для того, чтобы Ваш продукт был популярным и используемым, одним из важнейших аспектов является его дизайн. Наши специалисты в сфере UX/UI дизайна – это профессионалы своего дела, которые обладают кроме понимания принципов «юзабилити», еще и отличным художественным вкусом. Они сделают Ваш продукт уникальным и узнаваемым, что даст как минимум половину коммерческого успеха. А над второй половиной успеха поработают наши маркетологи и специалисты в рекламе и SEO.
                                </p>
                            </li>

                            <li class="strategies__item swiper-slide wow fadeInUp">
                                <div class="strategies__icon-block">
                                    <img class="strategies__icon" src="<?php echo get_template_directory_uri() ?>/assets/img/stages-icon-28.svg" alt="">
                                </div>

                                <p class="strategies__title">Веб-сайты</p>

                                <p class="strategies__text">
                                    Если Ваша компания не большая и нет необходимости в создании объемного портала, или Вы хотите, с коммерческой точки зрения, выделить отдельное направление деятельности, то возникает необходимость создания веб-сайта. Мы позаботимся о том, чтобы созданный нами ресурс был максимально удобен и интуитивно понятен в использовании, выделялся оригинальным дизайном и имел удобную систему управления контентом, которую сможет легко освоить любой Ваш сотрудник.
                                </p>
                            </li>

                            <li class="strategies__item swiper-slide wow fadeInUp">
                                <div class="strategies__icon-block">
                                    <img class="strategies__icon" src="<?php echo get_template_directory_uri() ?>/assets/img/stages-icon-29.svg" alt="">
                                </div>

                                <p class="strategies__title">Электронная коммерция</p>

                                <p class="strategies__text">
                                    Наш опыт позволяет создавать онлайн-магазины любой сложности, от самых простых и небольших проектов, до огромных онлайн-гипермаркетов и торговых площадок. Мы используем самые современные технологии, позволяющие без труда расширять и масштабировать Вашу деятельность в сфере электронной коммерции, используя масштабируемые архитектуры микросервисов и обеспечивая высокую степень автоматизации всех бизнес-процессов.
                                </p>
                            </li>
                        </ul>
                    </div>

                    <div class="path__arrows wow fadeInUp">
                        <div class="path__slider-button-prev swiper-button-prev"></div>
                        <div class="path__slider-button-next swiper-button-next"></div>
                    </div>
                </div>
            </div>
        </section>

        <section class="banner">
            <div class="banner__wrapper banner__wrapper--big wrapper">
                <h2 class="banner__title title wow fadeInLeftBig">Как мы <strong>разрабатываем</strong> веб-ресурсы</h2>

                <div class="banner__text wow fadeInRightBig">
                    <p>Разработка состоит из нескольких этапов, каждый из которых по-своему важен. В процессе разработки мы придерживаемся принципов качества и организации необходимого уровня контроля на каждом этапе, чтобы в результате Вы получили тот продукт, который хотите, и которым в последствии будете гордиться.</p>
                </div>
            </div>
        </section>

        <section class="info info--no-margin">
            <div class="info__wrapper wrapper">
                <h2 class="info__title title">Этапы <strong>разработки</strong></h2>

                <ol class="info__list steps">
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Бизнес-анализ и технический анализ</h4>
                            <p>Наши аналитики сосредоточатся на потребностях Вашей целевой аудитории для разработки требований и выбора необходимых технологических решений.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Разработка архитектуры</h4>
                            <p>На основании данных, предоставленных аналитиками, специалисты по архитектуре веб-решений и приложений спроектируют архитектуру Вашего проекта, для точного понимания каждой детали и функции, а так же для сопоставления интерфейсов Вашей системы с вероятными внешними решениями и продуктами.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Дизайн-проект</h4>
                            <p>Наши дизайнеры вступают в разработку. На этом этапе просчитываются и реализуются варианты визуального дизайна, пользовательских интерфейсов и взаимодействий. В результате проделанной работы будет готов дизайн-проект с просчитанным, максимально удобным и интуитивно понятным интерфейсом пользователя.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Фронтенд разработка</h4>
                            <p>Наши фронтенд-разработчики реализуют любую дизайнерскую идею и обеспечат корректное взаимодействие всех элементов интерфейса. Мы используем все актуальные фреймворки, такие как Angular, React, Meteor, Vue, Next, Ember и многие другие технологические решения.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Бэкенд разработка</h4>
                            <p>Инженеры-программисты точно реализуют логику Вашего веб-приложения со стороны сервера. Мы используем проверенные фреймворки и обеспечиваем быстрое и качественное написание кода на .Net, Java, Python, Node.js, PHP, Go и других популярных языках.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Интеграция</h4>
                            <p>Мы установим и настроим всё необходимое программное обеспечение для корректной работы Вашего проекта, а также все необходимые взаимосвязи с Вашими корпоративными или внешними решениями.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Тестирование и контроль качества</h4>
                            <p>Мы гарантируем, что Ваш проект будет работать безупречно, для этого наша команда тестировщиков тщательно исследует интегрированный проект и выявит все недостатки, узкие места и ошибки, после чего передаст продукт на доработку и исправление.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Служба поддержки</h4>
                            <p>В случае необходимости, мы предоставим помощь любого из наших специалистов в кратчайшее время на протяжение всего времени использования разработанного ПО. Мы обеспечим Вам бесперебойную работу Вашего продукта.</p>
                        </div>
                    </li>
                    <li class="steps__item wow fadeInUp">
                        <div class="steps__count"></div>
                        <div class="steps__text">
                            <h4>Развитие</h4>
                            <p>Технологии, бизнес и мир не стоят на месте. Рано или поздно Вам понадобится разработать новые функции, внести корректировки в логику работы бизнес-процессов, изменить дизайн и взаимодействия, внедрить более современные технологии. Наша команда разработчиков и поддержки обеспечит Вашему продукту продолжительную жизнь без необходимости вклада объемных инвестиций в разработку нового продукта, что позволит сэкономить существенные ресурсы, оставаясь на пике инноваций и технологий.</p>
                        </div>
                    </li>
                </ol>
            </div>
        </section>

        <section class="about-us">
            <div class="about-us__wrapper wrapper">
                <h2 class="visually-hidden">О нас</h2>
                <div class="about-us__content">

                    <div class="about-us__text about-us__text--top wow fadeInUp">
                        <div>
                            <h2 class="about-us__title title">Поддержка <strong>сайтов</strong></h2>
                            <p>Если у Вас есть существующие веб-проекты, такие как сайт, портал, блог или интернет-магазин, но недостаточно времени или персонала для его обслуживания, мы выделим Вам личных помощников для управления Вашим проектом. Любые задачи, связанные с его использованием, нам по силам. У Вас есть онлайн-магазин? Наши сотрудники помогут Вам ежедневно корректировать список продаваемой продукции, добавлять новые товары, менять описание, цены и т.д. Вы ведёте блог? Мы ежедневно будем выкладывать новые и актуальные новости и статьи. Вы открыли новое направление деятельности? Мы создадим необходимые дополнительные разделы на Вашем сайте, скорректируем и добавим нужную информацию и мультимедийный контент.
                            </p></div>
                    </div>

                    <div class="about-us__text about-us__text--bottom wow fadeInUp">
                        <p>Всё, что необходимо для ежедневного использования Вашего продукта – это наша работа, которая даст Вам уверенность в том, что информация будет своевременно донесена до Ваших потенциальных клиентов.</p>
                    </div>

                    <div class="about-us__images wow fadeInUp">
                        <img class="about-us__image" src="<?php echo get_template_directory_uri() ?>/assets/img/3-2-blok-5-1.jpg" alt="">
                        <img class="about-us__image" src="<?php echo get_template_directory_uri() ?>/assets/img/3-2-blok-5-2.jpg" alt="">
                    </div>
                </div>
            </div>
        </section>

        <section class="discuss discuss--no-margin">
            <?php include 'contact-form.php' ?>
        </section>
    </main>

<?php get_footer() ?>